app/controllers/contacts_controller.rb

SELECT * FROM "contacts"
---
  def index
    if current_user
      @user = current_user

      if params[:tag].nil?
        @contacts = current_user.contacts.paginate :per_page => 10, :page => params[:page], :order => 'updated_at DESC'

SELECT * FROM "contacts" WHERE ("contacts"."id" = 0)
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("gg", "city", "created_at", "post_code", "updated_at", "street", "homepage", "phone", "surname", "first_name", "email") VALUES(121, 'we', '2009-10-25 19:44:29', 'e', '2009-10-25 19:44:29', 'drf', 'www.pajacyk.pl', '121', 'drzazgowski', 'bartek', 'aaa@gmail.com')
---
  def create
    @user = current_user
    @contact = Contact.new(params[:contact])
    @contact.category = Category.find(params[:category_id])
    @user.contacts << @contact

SELECT * FROM "contacts" WHERE ("contacts"."id" = 2)
UPDATE "contacts" SET "updated_at" = '2009-10-25 21:28:25', "email" = 'bartek4674@gmail.com' WHERE "id" = 1
---
  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 3)
DELETE FROM "contacts" WHERE "id" = 3
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy